Repository: raccoongang/openedx-xblock-inline-dropdown
Catalog: inline_text_and_dropdown/translations/*/LC_MESSAGES/text.po
Languages: uk

source: Display Name
uk: Назва, що відображається

source: Inline Text and Dropdown
uk: Вбудований текст і випадаюче меню

source: This name appears in the horizontal navigation at the top of the page
uk: Ця назва відображається в горизонтальній навігації вгорі сторінки

source: Hints for the question
uk: Підказки для питання

source: Default question content
uk: Зміст запитання за замовчуванням

source: Correctness of input values
uk: Правильність введених значень

source: Order of selections in body
uk: Порядок виділень в тексті

source: Saved student input values
uk: Збережені вхідні значення студента

source: Saved student correctness values
uk: Збережені значення правильності студента

source: Feedback for input values
uk: Відгук про введені значення

source: Current feedback state
uk: Поточний стан зворотного зв'язку

source: Indicates whether the learner has completed the problem at least once
uk: Вказує на те, що учень хоча б раз виконував завдання.

source: Weight
uk: Вага

source: This assigns an integer value representing the weight of this problem
uk: Це присвоює ціле значення, що представляє вагу цієї проблеми

source: Randomize
uk: Випадково

source: Enable randomization of the dropdown values.
uk: Увімкнути рандомізацію випадаючих значень.

source: Show Correctness
uk: Показати коректність

source: Enable displaying grades and correctness for answers
uk: Увімкніть показ оцінок та правильність відповідей

source: Show Reset Button
uk: Показати кнопку скидання

source: Determines whether a 'Reset' button is shown so the user may reset their answer.
uk: Визначає, чи відображається кнопка 'Скинути', щоб користувач міг скинути свою відповідь.

source: Random seed for this student
uk: Випадкове зерно для цього учня

source: Correct
uk: Правильно

source: Incorrect
uk: Невірно

source: Answer submitted.
uk: Відповідь відправлено.

source: Missing event_type in JSON data
uk: У даних JSON відсутній event_type

source: {weight} point possible
uk: можливо балів {weight}

source: /{weight} point
uk: /{weight} бали

source: Definition
uk: Визначення

source: The definition for the problem
uk: Визначення проблеми

source: Submitting
uk: Відправлення на перевірку

source: Hint
uk: Підказка

source: Use Hint
uk: Використати підказку

source: Reset
uk: Скинути

source: Reset your answer
uk: Скинути відповідь

source: Save
uk: Зберегти

source: Cancel
uk: Скасувати
